[
    {
        "id": "2053e213-a5d7-46de-b495-06ba7855870d",
        "course": {
            "title": "The Complete Web Development Bootcamp",
            "image": "https://drive.google.com/file/d/1uWCA5ZG2waf-o6U3PJ-CMJLRd4xryhtT/view?usp=sharing",
            "rating": "4.7",
            "price": "$95.82",
            "lessonNumber": "92",
            "duration": "65",
            "lectures": "24",
            "quizzes": "14"
        },
        "shortDes": "Become a Full-Stack Web Developer with just ONE course. HTML, CSS, Javascript, Node, React, MongoDB and More.",
        "des": "Welcome to the Complete Web Development Bootcamp, the only course you need to learn to code and become a full-stack web developer. With 100,000+ ratings and a 4.7 average, my Web Development course is one of the HIGHEST RATED courses in the history! At 65+ hours, this Web Development course is without a doubt the most comprehensive web development course available online. Even if you have zero programming experience, this course will take you from beginner to mastery.",
        "learn": [
            "You will learn the latest technologies, including Javascript, React, Node and even Web3 development",
            "Master frontend development with React",
            "Learn professional developer best practices",
            "Master backend development with Node"
        ],
        "instructor ": {
            "name": "Kristopher Rippin",
            "image": "https://drive.google.com/file/d/10K4TxNuLQdf9mvQdNS2df5xndkYRu8BC/view?usp=sharing",
            "id": "10f8bf42-2711-41b6-ac8a-67da20acef98"
        },
        "lastUpdate": "2022-01-08",
        "language ": "English",
        "targetAudience": [
            "If you want to learn to code through building fun and useful projects, then take this course.",
            "If you want to start your own startup by building your own websites and web apps.",
            "If you are a seasoned programmer, then take this course to to get up to speed quickly with the latest frameworks and NodeJS"
        ],
        "tag": [
            "Web",
            "Design",
            "Development"
        ]
    },
    {
        "id": "0cbe2ab3-5476-451a-ab37-787eb90aefc7",
        "course": {
            "title": "Zero to Hero in Python",
            "image": "https://drive.google.com/file/d/1owqQ2Bg0zr9IkwhLpLBncMChj4r8ko7j/view?usp=sharing",
            "rating": "4.4",
            "price": "$65.82",
            "lessonNumber": "72",
            "duration": "60",
            "lectures": "20",
            "quizzes": "11"
        },
        "shortDes": "Learn Python like a Professional Start from the basics and go all the way to creating your own applications and games",
        "des": "Become a Python Programmer and learn one of employer's most requested skills of 2022! This is the most comprehensive, yet straight-forward, course for the Python programming language! Whether you have never programmed before, already know basic syntax, or want to learn about the advanced features of Python, this course is for you! In this course we will teach you Python 3. With over 100 lectures and more than 21 hours of video this comprehensive course leaves no stone unturned! This course includes quizzes, tests, coding exercises and homework assignments as well as 3 major projects to create a Python project portfolio! Learn how to use Python for real-world tasks, such as working with PDF Files, sending emails, reading Excel files, Scraping websites for informations, working with image files, and much more! This course will teach you Python in a practical manner, with every lecture comes a full coding screencast and a corresponding code notebook! Learn in whatever manner is best for you! We will start by helping you get Python installed on your computer, regardless of your operating system, whether its Linux, MacOS, or Windows, we've got you covered.",
        "learn": [
            "You will learn how to leverage the power of Python to solve tasks.",
            "You will build games and programs that use Python libraries.",
            "You will be able to use Python for your own work problems or personal projects.",
            "You will create a portfolio of Python based projects you can share."
        ],
        "instructor ": {
            "name": "Ted Abshire",
            "image": "https://drive.google.com/file/d/1WHCaHWQOEB3njp1RGmFZnHmQ1fJHc28D/view?usp=sharing",
            "id": "2152377e-2813-4f76-a39c-e7222f9de6b9"
        },
        "lastUpdate": "2022-10-04",
        "language ": "English",
        "targetAudience": [
            "Beginners who have never programmed before.",
            "Programmers switching languages to Python.",
            "Intermediate Python programmers who want to level up their skills!"
        ],
        "tag": [
            "Python",
            "Programming"
        ]
    },
    {
        "id": "8aa30479-b0a6-41c7-b2ad-ac9e05030a58",
        "course": {
            "title": "React - The Complete Guide",
            "image": "https://drive.google.com/file/d/1Sv1My4j3ltJrv5wpqWH6qHOw5Fkeb1eg/view?usp=sharing",
            "rating": "4.8",
            "price": "$81.16",
            "lessonNumber": "61",
            "duration": "21",
            "lectures": "44",
            "quizzes": "10"
        },
        "shortDes": "Dive in and learn React.js from scratch! Learn React JS, Hooks, Redux, React Routing, Animations, Next.js and way more!",
        "des": "Welcome to 'React - The Complete Guide'! This course will teach you React.js in a practice-oriented way, using all the latest patterns and best practices you need. You will learn all the key fundamentals as well as advanced concepts and related topics to turn you into a React.js developer. This is a huge course because it really covers EVERYTHING you need to know and learn to become a React.js developer! No matter if you know nothing about React or if you already got some basic React knowledge (not required but also not a problem), you will get tons of useful information and knowledge out of this course! My goal with this course is to ensure that you feel confident working with React, so that you can apply for React jobs, use it in your own projects or simply enhance your portfolio as a developer - whatever your goal is: This course gets you there!",
        "learn": [
            "Build powerful, fast, user-friendly and reactive web apps",
            "Provide amazing user experiences by leveraging the power of JavaScript with ease",
            "Learn all about React Hooks and React Components"
        ],
        "instructor ": {
            "name": "Sophie Prosacco",
            "image": "https://drive.google.com/file/d/1LQQ9kOaJ-Bj0tK5UTZHNTPE5xcSK4mqn/view?usp=sharing",
            "id": "1c2559b4-7b12-40d2-b4e1-e52438aa7cea"
        },
        "lastUpdate": "2022-05-16",
        "language ": "English",
        "targetAudience": [
            "Anyone who's interested in learning an extremely popular technology",
            "Students who want to learn how to build reactive and fast web apps"
        ],
        "tag": [
            "React JS",
            "Web",
            "Development"
        ]
    },
    {
        "id": "0384def3-7a6b-41cd-962f-bde7d448f19e",
        "course": {
            "title": "Javascript for Beginners",
            "image": "https://drive.google.com/file/d/1A3Wsx4JbLPFKA698S8H8Tu5-qp49oYdv/view?usp=sharing",
            "rating": "4.6",
            "price": "$69.40",
            "lessonNumber": "31",
            "duration": "100",
            "lectures": "64",
            "quizzes": "8"
        },
        "shortDes": "JavaScript for Beginners : Work closely with me doing exercises & learn more. I make Javascript easy for you guaranteed.",
        "des": "This course if for absolute beginners, and it is an introduction to the major components of javascript. By learning the bigger things in Javascript, you will be able to know how to put the remaining pieces together and will be able to get into advanced courses more prepared. I'm not going to start this course with False promises. At the end of this course, you will NOT become an expert and nor will you in any other course. To become an expert in Javascript or any other programming language you need many hours of practice and experience; more like years of practice and experience.",
        "learn": [
            "Learn to write JavaScript functions",
            "Learn to write Javascript arrays",
            "Learn to write Javascript loops",
            "Learn to about Javascript variables"
        ],
        "instructor ": {
            "name": "Ray Donnelly",
            "image": "https://drive.google.com/file/d/1qLTyzY3TJb2G0EU85Zbf8JIEI13At3lh/view?usp=sharing",
            "id": "b9c1dacc-c061-452b-a2f1-462e787975d0"
        },
        "lastUpdate": "2022-10-10",
        "language ": "English",
        "targetAudience": [
            "This course is meant for absolute beginners of Javascript",
            "This course is meant for students that struggled to learn the language before",
            "This course is meant for students with a little HTML knowledge"
        ],
        "tag": [
            "JavaScript",
            "Web",
            "Development"
        ]
    },
    {
        "id": "6120eab2-fe83-40ee-a24f-efc077d7576f",
        "course": {
            "title": "The Complete SQL and MySQL Course",
            "image": "https://drive.google.com/file/d/1JGLVjCaBbIwaJhHQWG0cXF64f9KmXT8C/view?usp=sharing",
            "rating": "5.0",
            "price": "$29.40",
            "lessonNumber": "44",
            "duration": "21",
            "lectures": "44",
            "quizzes": "9"
        },
        "shortDes": "Learn the Basics of Managing Data with SQL - Basics, Transactions, Views, Pages and Stored Procedures",
        "des": "In this course you can learn the fundamental basics of data management with SQL and MySQL. Learn everything that you will need to make queries with the most popular data manipulating programming language - SQL. This course is about SQL commands in the main. You will learn the basics of queries.",
        "learn": [
            "understand the basic concepts of databases",
            "get a good grasp of SQL and MySQL queries",
            "understand database management systems (DBMSs) and database languages",
            "understand stored procedures"
        ],
        "instructor ": {
            "name": "Neal Rodriguez",
            "image": "https://drive.google.com/file/d/10NFnadiP6qAIWZ_7iSen4KiW7xYgtPmN/view?usp=sharing",
            "id": "7ac1e75a-d4fb-4e46-bc9b-e27e141857b5"
        },
        "lastUpdate": "2022-03-01",
        "language ": "English",
        "targetAudience": [
            "This course is mean for newbies who are not familiar with SQL syntax or just want to refresh the knowledge"
        ],
        "tag": [
            "SQL",
            "MySQL",
            "BackEnd"
        ]
    },
    {
        "id": "454f0bd8-6598-4005-8047-bdc30697c380",
        "course": {
            "title": "MERN: The Complete Bootcamp",
            "image": "https://drive.google.com/file/d/1tT-guY94AmRRKA4Nzxb3yxnObbFfbx8r/view?usp=sharing",
            "rating": "5.0",
            "price": "$90.76",
            "lessonNumber": "69",
            "duration": "92",
            "lectures": "38",
            "quizzes": "14"
        },
        "shortDes": "Master Node by building a real-world RESTful API and web app (with authentication, Node.js security, payments & more)",
        "des": "Do you want to build fast and powerful back-end applications with JavaScript? Would you like to become a more complete and in-demand developer? Then Node.js is the hot technology for you to learn right now, and you came to the right place to do it! Welcome to the Complete Node.js, Express, and MongoDB Bootcamp, your fast track to modern back-end development. This course is the perfect all-in-one package that will take you from a complete beginner to an advanced, highly-skilled Node.js developer. Like all my other courses, this one is completely project-based! And not just any project: it's a complete, beautiful, and feature-rich application, containing both a RESTful API and a server-side rendered website. It's the most fantastic and complete project that you will find in any Node.js course on the internet! By building this huge project, you will learn all the skills that you need in order to plan, build, and deploy your own modern back-end applications with Node.js and related technologies.",
        "learn": [
            "Master the entire modern back-end stack: Node, Express, MongoDB and Mongoose (MongoDB JS driver)",
            "Build a fast, scalable, feature-rich RESTful API (includes filters, sorts, pagination, and much more)",
            "Build a complete, beautiful & real-world application from start to finish (API and server-side rendered website)"
        ],
        "instructor ": {
            "name": "Billie Beier",
            "image": "https://drive.google.com/file/d/1ZMQ3aOHHX64yW1I4JgENNBdnh7XXcPif/view?usp=sharing",
            "id": "2d1a36d1-22ef-4803-b183-3d7489d1ecdb"
        },
        "lastUpdate": "2022-08-18",
        "language ": "English",
        "targetAudience": [
            "Take this course if you want to build amazingly fast and scalable back-end applications using the JavaScript skills you already have. Node is the perfect tool for you!",
            "Take this course if you're a front-end developer looking to go into back-end development using the most complete course on the market."
        ],
        "tag": [
            "Node JS",
            "MongoDB",
            "Development"
        ]
    }
]